embedded-office/uc-can/Drivers/STM32F20X/drv_can.c
/*
*********************************************************************************************************
*                                              uC/CAN
*                                      The Embedded CAN suite
*
*                 Copyright by Embedded Office GmbH & Co. KG www.embedded-office.com
*                    Copyright 1992-2020 Silicon Laboratories Inc. www.silabs.com
*
*                                 SPDX-License-Identifier: APACHE-2.0
*
*               This software is subject to an open source license and is distributed by
*                Silicon Laboratories Inc. pursuant to the terms of the Apache License,
*                    Version 2.0 available at www.apache.org/licenses/LICENSE-2.0.
*
*********************************************************************************************************
*/


/*
****************************************************************************************************
* Filename : drv_can.c
* Version  : V2.42.01
****************************************************************************************************
*/

/*
****************************************************************************************************
*                                             INCLUDES
****************************************************************************************************
*/

#include "drv_can.h"
#include "drv_def.h"
#include "drv_can_reg.h"

/*
****************************************************************************************************
*                                            LOCAL DATA
****************************************************************************************************
*/

/*------------------------------------------------------------------------------------------------*/
/*!
* \brief    DRIVER IDENTIFICATION CODE
*
* \ingroup  STM32F20X_CAN
*
*           This constant holds the unique driver identification code.
*/
/*------------------------------------------------------------------------------------------------*/
static const CPU_INT32U DrvIdent = 0x243F1501;

/*------------------------------------------------------------------------------------------------*/
/*!
* \brief    DRIVER ERROR CODE
*
* \ingroup  STM32F20X_CAN
*
*           This variable holds the detailed error code if an error is detected.
*/
/*------------------------------------------------------------------------------------------------*/
static CPU_INT16U DrvError;

/*
****************************************************************************************************
*                                           GLOBAL DATA
****************************************************************************************************
*/

/*------------------------------------------------------------------------------------------------*/
/*!
* \brief    DEVICE RUNTIME DATA
*
* \ingroup  STM32F20X_CAN
*
*           This variable holds the device runtime data.
*/
/*------------------------------------------------------------------------------------------------*/
STM32F20X_CAN_DATA DevData[STM32F20X_CAN_N_DEV];

/*
****************************************************************************************************
*                                            FUNCTIONS
****************************************************************************************************
*/

/*------------------------------------------------------------------------------------------------*/
/*!
* \brief    CAN INITIALIZATION
*
* \ingroup  STM32F20X_CAN
*
*           Initializes the CAN device with the given device name.
*
* \param    arg  the CAN device name
*
* \return   error code (0 if OK, -1 if an error occurred)
*/
/*------------------------------------------------------------------------------------------------*/
CPU_INT16S STM32F20XCANInit (CPU_INT32U arg)
{
    STM32F20X_CAN_DATA *dev;                          /* Local: Pointer to can device             */
    STM32F20X_CAN_t    *can;                          /* Local: Pointer to can register           */
    STM32F20X_CAN_t    *can0;                         /* Local: Pointer to can register           */
    CPU_INT32U          i;                            /* Local: loop variable                     */
    CPU_INT32U          tmp;                          /* Local: help variable                     */
    CPU_INT16S          result = -1;                  /* Local: Function result                   */
                                                      /*------------------------------------------*/
#if STM32F20X_CAN_ARG_CHK_CFG > 0                     /* Checking arguments (if enabled)          */
    if (arg >= STM32F20X_CAN_N_DEV) {                 /* can dev out of range?                    */
        DrvError = STM32F20X_CAN_INIT_ERR;
        return (result);
    }
#endif                                                /*------------------------------------------*/
    DrvError = STM32F20X_CAN_NO_ERR;                  /* reset to 0                               */
                                                      /*------------------------------------------*/
    dev = &DevData[arg];                              /* set pointer to can device                */
    dev->Use = 0;                                     /* set device to unused                     */
                                                      /*------------------------------------------*/
    STM32F20XCAN_PinCfg(arg);                         /* apply pin configuration                  */
                                                      /*------------------------------------------*/
    if (arg == STM32F20X_CAN_BUS_0) {
        dev->Base = (void *)STM32F20X_CAN1_BASE;          /* set CAN 1 base address               */
        *(volatile CPU_INT32U *)0x40023840 |= 0x02000000; /* RCC_APB1ENR: enable CAN 1 clock      */
    } else {
        DevData[STM32F20X_CAN_BUS_0].Base = (void *)STM32F20X_CAN1_BASE;/* set CAN 1 base address */
        *(volatile CPU_INT32U *)0x40023840 |= 0x02000000; /* RCC_APB1ENR: enable CAN 1 clock also */
        dev->Base = (void *)STM32F20X_CAN2_BASE;          /* set CAN 2 base address               */
        *(volatile CPU_INT32U *)0x40023840 |= 0x04000000; /* RCC_APB1ENR: enable CAN 2 clock      */
    }

    can = (STM32F20X_CAN_t *)dev->Base;
                                                      /*------------------------------------------*/
    can->MCR &= ~STM32F20X_CAN_MCR_SLEEP;             /* exit sleep mode                          */
                                                      /*------------------------------------------*/
    can->MCR = STM32F20X_CAN_MCR_INRQ;                /* set init bit                             */
    while ((can->MSR & STM32F20X_CAN_MSR_INAK) == 0) {/* wait for init mode                       */
    }
                                                      /*------------------------------------------*/
    dev->Baudrate        = STM32F20X_DEF_BAUDRATE;    /* Initialize parameter struct of the       */
    dev->SamplePoint     = STM32F20X_DEF_SP;          /* current device                           */
    dev->ResynchJumpWith = STM32F20X_DEF_RJW;
                                                      /*------------------------------------------*/
    STM32F20XCAN_CalcTimingReg(dev);                  /* Calculate the values for the timing      */
                                                      /* register with the parameter setting      */
                                                      /*------------------------------------------*/
    can->BTR = (dev->RJW   << 24) |                   /* Set the bit timing register              */
               (dev->PSEG1 << 16) |
               (dev->PSEG2 << 20) |
               (dev->PRESDIV);
                                                      /*------------------------------------------*/
                                                      /* Only can 1 has the filter regs.          */
    can0 = (STM32F20X_CAN_t *)DevData[STM32F20X_CAN_BUS_0].Base;

    can0->FMR   |=  STM32F20X_CAN_FMR_FINIT;          /* set filter initialization to init        */
    can0->FMR   &= ~0x00003F00;                       /* clear can 2 start bank                   */
    can0->FMR   |=  (14 << 8);                        /* set can 2 start bank to 14               */
    can0->FM1R   =  0;                                /* All filter modes mask                    */
    can0->FS1R   =  0x0FFFFFFF;                       /* All filter scale single                  */
    can0->FFA1R  =  0x00000002 |                      /* can 1: fifo 0 & 1 assigned to filter  0 &  1 */
                    0x00008000;                       /* can 2: fifo 0 & 1 assigned to filter 14 & 15 */
    can0->FA1R   =  0x00000003 |                      /* can 1: filter  0 &  1 active             */
                    0x0000C000;                       /* can 2: filter 14 & 15 active             */
                                                      /* (only fifo 0 will receive data)          */
    if (arg == STM32F20X_CAN_BUS_0) {
        for (i = 0; i < 14; i++){
            can0->FilterRegister[i].FR1 = 0;          /* reset identifier/mask                    */
            can0->FilterRegister[i].FR2 = 0;
        }
    } else {
        for (i = 14; i < 28; i++){
            can0->FilterRegister[i].FR1 = 0;          /* reset identifier/mask                    */
            can0->FilterRegister[i].FR2 = 0;
        }
    }
    can0->FMR   &= ~STM32F20X_CAN_FMR_FINIT;          /* set filter initialization to active      */
                                                      /*------------------------------------------*/
    can->MCR &= ~STM32F20X_CAN_MCR_INRQ;              /* Request leave initialization             */
    while ((can->MSR & STM32F20X_CAN_MSR_INAK) == 1) {/* wait for end of init mode                */
    }
                                                      /*------------------------------------------*/
    if (arg == STM32F20X_CAN_BUS_0) {
#if STM32F20X_CAN1_RX_INTERRUPT_EN > 0
        tmp = (STM32F20X_CAN1_RX1_IRQ_PRIO <<  4) +       /* shift prio to register position          */
              (STM32F20X_CAN1_RX1_IRQ_PRIO << 12);
        *(volatile CPU_INT32U *)0xE000E414 |= tmp;        /* Set priority for rx0 and rx1 irq in NVIC IPR */
        *(volatile CPU_INT32U *)0xE000E100 |= 0x00300000; /* Set enable CAN Rx0/1 irq in NVIC ISER    */
        can->IER |= 0x12;                                 /* Enable fifo msg pending irq both fifos   */
#endif

#if STM32F20X_CAN1_TX_INTERRUPT_EN > 0
        tmp = (STM32F20X_CAN1_TX_IRQ_PRIO << 28);         /* shift prio to register position          */
        *(volatile CPU_INT32U *)0xE000E410 |= tmp;        /* Set priority for rx0 and rx1 irq in NVIC IPR */
        *(volatile CPU_INT32U *)0xE000E100 |= 0x00080000; /* Set enable CAN Tx irq in NVIC ISER       */
        can->IER |= 0x01;                                 /* Enable transmit mailbox empty irq        */
#endif

#if STM32F20X_CAN1_NS_INTERRUPT_EN > 0
        tmp = (STM32F20X_CAN1_NS_IRQ_PRIO << 20);         /* shift prio to register position          */
        *(volatile CPU_INT32U *)0xE000E414 |= tmp;        /* Set priority for rx0 and rx1 irq in NVIC IPR */
        *(volatile CPU_INT32U *)0xE000E100 |= 0x00400000; /* Set enable CAN SCE irq in NVIC ISER      */
        can->IER |= 0x8700;                               /* Enable Error Warning/Bus Off Interrupt   */
#endif
    } else {
#if STM32F20X_CAN2_RX_INTERRUPT_EN > 0
        tmp = (STM32F20X_CAN2_RX1_IRQ_PRIO <<  4) +       /* shift prio to register position          */
              (STM32F20X_CAN2_RX1_IRQ_PRIO << 12);
        *(volatile CPU_INT32U *)0xE000E440 |= tmp;        /* Set priority for rx0 and rx1 irq in NVIC IPR */
        *(volatile CPU_INT32U *)0xE000E108 |= 0x00000003; /* Set enable CAN Rx0/1 irq in NVIC ISER    */
        can->IER |= 0x12;                                 /* Enable fifo msg pending irq both fifos   */
#endif

#if STM32F20X_CAN2_TX_INTERRUPT_EN > 0
        tmp = (STM32F20X_CAN2_TX_IRQ_PRIO << 28);         /* shift prio to register position          */
        *(volatile CPU_INT32U *)0xE000E43C |= tmp;        /* Set priority for rx0 and rx1 irq in NVIC IPR */
        *(volatile CPU_INT32U *)0xE000E104 |= 0x80000000; /* Set enable CAN Tx irq in NVIC ISER       */
        can->IER |= 0x01;                                 /* Enable transmit mailbox empty irq        */
#endif

#if STM32F20X_CAN2_NS_INTERRUPT_EN > 0
        tmp = (STM32F20X_CAN2_NS_IRQ_PRIO << 20);         /* shift prio to register position          */
        *(volatile CPU_INT32U *)0xE000E440 |= tmp;        /* Set priority for rx0 and rx1 irq in NVIC IPR */
        *(volatile CPU_INT32U *)0xE000E108 |= 0x00000004; /* Set enable CAN SCE irq in NVIC ISER      */
        can->IER |= 0x8700;                               /* Enable Error Warning/Bus Off Interrupt   */
#endif
    }

    result = STM32F20X_CAN_NO_ERR;
                                                      /*------------------------------------------*/
    return (result);                                  /* Return function result                   */
}

/*------------------------------------------------------------------------------------------------*/
/*!
* \brief    OPEN CAN DEVICE
*
* \ingroup  STM32F20X_CAN
*
*           Unlocks the device, i.e. IoCtl/Read/Write-function will take effect.
*
* \param    devId    the bus node name which must be used by the interrupt routine to access the
*                    CAN bus layer.
* \param    devName  the CAN device name
* \param    mode     the mode in which the CAN device will be used
*
* \return   the parameter identifier for further access or -1 if an error occurred
*/
/*------------------------------------------------------------------------------------------------*/
CPU_INT16S STM32F20XCANOpen (CPU_INT16S devId, CPU_INT32U devName, CPU_INT16U mode)
{
    STM32F20X_CAN_DATA *dev;                          /* Local: Pointer to can device             */
    CPU_INT16S          result = -1;                  /* Local: Function result                   */
    CPU_SR_ALLOC();                                   /* Allocate storage for CPU status reg.     */
                                                      /*------------------------------------------*/
#if STM32F20X_CAN_ARG_CHK_CFG > 0
    if (devName >= STM32F20X_CAN_N_DEV) {             /* check that device name is in range       */
        DrvError = STM32F20X_CAN_BUS_ERR;
        return (result);                              /* return function result                   */
    }
    if (mode != DEV_RW) {                             /* mode not supported?                      */
        DrvError = STM32F20X_CAN_MODE_ERR;
        return (result);
    }
#endif
    dev = &DevData[devName];                          /* set pointer to can device                */

    CPU_CRITICAL_ENTER();
    if (dev->Use == 0) {                              /* check, that can device is unused         */
        dev->Use = 1;                                 /* mark can device as used                  */
#if ((STM32F20X_CAN1_RX_INTERRUPT_EN > 0) || \
     (STM32F20X_CAN1_TX_INTERRUPT_EN > 0) || \
     (STM32F20X_CAN1_NS_INTERRUPT_EN > 0) || \
     (STM32F20X_CAN2_RX_INTERRUPT_EN > 0) || \
     (STM32F20X_CAN2_TX_INTERRUPT_EN > 0) || \
     (STM32F20X_CAN2_NS_INTERRUPT_EN > 0))
        STM32F20XCAN_SetDevIds(devId, devName);       /* store the received Node Id for the irqs  */
#else
        devId    = devId;                             /* prevent compiler warning                 */
#endif
        result   = (CPU_INT16S)devName;               /* Okay, device is opened                   */
    } else {
        DrvError = STM32F20X_CAN_OPEN_ERR;
    }
    CPU_CRITICAL_EXIT();
                                                      /*------------------------------------------*/
    return (result);                                  /* return function result                   */
}

/*------------------------------------------------------------------------------------------------*/
/*!
* \brief    CLOSE CAN DEVICE
*
* \ingroup  STM32F20X_CAN
*
*           Locks the device, i.e. IoCtl/Read/Write-function will have no effect.
*
* \param    paraId  the parameter identifier, returned by XXXCANOpen()
*
* \return   error code (0 if OK, -1 if an error occurred)
*/
/*------------------------------------------------------------------------------------------------*/
CPU_INT16S STM32F20XCANClose (CPU_INT16S paraId)
{
    STM32F20X_CAN_DATA *dev;                          /* Local: Pointer to can device             */
    CPU_INT16S          result = -1;                  /* Local: Function result                   */
    CPU_SR_ALLOC();                                   /* Allocate storage for CPU status reg.     */
                                                      /*------------------------------------------*/
#if STM32F20X_CAN_ARG_CHK_CFG > 0
    if ((paraId >= STM32F20X_CAN_N_DEV) || (paraId < 0)) { /* check that paraId is in range       */
        DrvError = STM32F20X_CAN_BUS_ERR;
        return (result);                              /* return function result                   */
    }
#endif
    dev = &DevData[paraId];                           /* Set pointer to can device                */

    CPU_CRITICAL_ENTER();
    if (dev->Use != 0) {                              /* check, that can device is used           */
        dev->Use = 0;                                 /* mark can device as unused                */
        result   = STM32F20X_CAN_NO_ERR;              /* Indicate successful function execution   */
    } else {
        DrvError = STM32F20X_CAN_CLOSE_ERR;
    }
    CPU_CRITICAL_EXIT();
                                                      /*------------------------------------------*/
    return (result);                                  /* return function result                   */
}

/*------------------------------------------------------------------------------------------------*/
/*!
* \brief    CAN I/O CONTROL
*
* \ingroup  STM32F20X_CAN
*
*           This function performs a special action on the opened device. The function code func
*           defines what the caller wants to do. Description of function codes as defined in
*           header file.
*
* \param    paraId  parameter identifier, returned by XXXCANOpen()
* \param    func    function code
* \param    argp    argument list, specific to the function code
*
* \return   error code (0 if OK, -1 if an error occurred)
*/
/*------------------------------------------------------------------------------------------------*/
CPU_INT16S STM32F20XCANIoCtl (CPU_INT16S paraId, CPU_INT16U func, void *argp)
{
    STM32F20X_CAN_DATA *dev;                          /* Local: Pointer to can device             */
    STM32F20X_CAN_t    *can;                          /* Local: Pointer to can register           */
    STM32F20X_CAN_t    *can0;                         /* Local: Pointer to can register           */
    CPU_INT32U          status_reg;                   /* Local: register value                    */
    CPU_INT16S          TransmitMailbox = -1;         /* Local: Tx mailbox Id                     */
    CPU_INT32U          i;                            /* Local: loop variable                     */
    CPU_INT32U          mask;                         /* Local: mask for filter                   */
    CPU_INT32U          canId;                        /* Local: id for filter                     */
    CPU_INT16S          result          = -1;         /* Local: Function result                   */
    CPU_SR_ALLOC();                                   /* Allocate storage for CPU status reg.     */
                                                      /*------------------------------------------*/
#if STM32F20X_CAN_ARG_CHK_CFG > 0
    if ((paraId >= STM32F20X_CAN_N_DEV) || (paraId < 0)) { /* check that paraId is in range       */
        DrvError = STM32F20X_CAN_BUS_ERR;
        return (result);                              /* return function result                   */
    }
#endif
    dev = &DevData[paraId];                           /* set pointer to can device                */
#if STM32F20X_CAN_ARG_CHK_CFG > 0
    if (dev->Use != 1) {                              /* check, that can device is opened         */
        DrvError = STM32F20X_CAN_OPEN_ERR;
        return (result);                              /* return function result                   */
    }
#endif
    can  = (STM32F20X_CAN_t *)dev->Base;
                                                      /* Only can 0 has filter regs.              */
    can0 = (STM32F20X_CAN_t *)DevData[STM32F20X_CAN_BUS_0].Base;

