embedded-office/uc-can/Drivers/STM32F20X/drv_can.c
    CPU_CRITICAL_ENTER();
                                                      /*------------------------------------------*/
    switch (func) {                                   /* select: function code                    */
                                                      /*------------------------------------------*/
        case IO_STM32F20X_CAN_GET_IDENT:              /* GET IDENT                                */
            (*(CPU_INT32U *)argp) = DrvIdent;         /* return driver ident code                 */
            result = STM32F20X_CAN_NO_ERR;            /* Indicate successful function execution   */
            break;                                    /*------------------------------------------*/
        case IO_STM32F20X_CAN_GET_ERRNO:              /* GET ERRORCODE                            */
            (*(CPU_INT16U *)argp) = DrvError;         /* return last detected errorcode           */
            result = STM32F20X_CAN_NO_ERR;            /* Indicate successful function execution   */
            break;                                    /*------------------------------------------*/
        case IO_STM32F20X_CAN_GET_DRVNAME:            /* GET DRIVER NAME                          */
            (*(CPU_INT08U **)argp) = (CPU_INT08U *)   /* return human readable driver name        */
                                     STM32F20X_CAN_NAME;
            result = STM32F20X_CAN_NO_ERR;            /* Indicate successful function execution   */
            break;                                    /*------------------------------------------*/
        case IO_STM32F20X_CAN_SET_BAUDRATE:           /* SET BAUDRATE                             */
            dev->Baudrate = *(CPU_INT32U *)argp;      /* Set baudrate parameter to given argument */
                                                      /* and calculate the values for the timing  */
                                                      /* register with the parameter setting      */
            if (STM32F20XCAN_CalcTimingReg(dev) != STM32F20X_CAN_NO_ERR) {
                DrvError = STM32F20X_CAN_ARG_ERR;     /* indicate error on function result.       */
            } else {                                  /* set can timing registers if timing       */
                                                      /* calculation success.                     */
                can->MCR |=  STM32F20X_CAN_MCR_INRQ;  /* set init bit                             */
                while ((can->MSR & STM32F20X_CAN_MSR_INAK) == 0) { /* wait for init mode          */
                }
                can->BTR  =  (dev->RJW   << 24) |     /* Set the bit timing register              */
                             (dev->PSEG1 << 16) |
                             (dev->PSEG2 << 20) |
                             (dev->PRESDIV);
                can->MCR &= ~STM32F20X_CAN_MCR_INRQ;  /* Request leave initialization             */
                while ((can->MSR & STM32F20X_CAN_MSR_INAK) == 1) { /* wait for end of init mode   */
                }
                result = STM32F20X_CAN_NO_ERR;        /* Indicate successful function execution   */
            }
            break;                                    /*------------------------------------------*/
        case IO_STM32F20X_CAN_TX_READY:               /* TX READY?                                */
                                                      /* check for empty transmit mailbox         */
            if ((can->TSR & STM32F20X_CAN_TSR_TME0) == STM32F20X_CAN_TSR_TME0) {
                TransmitMailbox = 0;
            } else if ((can->TSR & STM32F20X_CAN_TSR_TME1) == STM32F20X_CAN_TSR_TME1) {
                TransmitMailbox = 1;
            } else if ((can->TSR & STM32F20X_CAN_TSR_TME2) == STM32F20X_CAN_TSR_TME2) {
                TransmitMailbox = 2;
            }

            if (TransmitMailbox < 0) {
                *((CPU_INT08U *)argp) = 0;            /* Transmit Channel is not available        */
            } else {
                *((CPU_INT08U *)argp) = 1;            /* Transmit Channel is available            */
            }
            result = STM32F20X_CAN_NO_ERR;            /* Indicate successful function execution   */
            break;                                    /*------------------------------------------*/
        case IO_STM32F20X_CAN_START:                  /* START CAN                                */
            can->MCR &= ~STM32F20X_CAN_MCR_INRQ;      /* reset init bit                           */
            while ((can->MSR & STM32F20X_CAN_MSR_INAK) == 1) { /* wait for end of init mode       */
            }
            result = STM32F20X_CAN_NO_ERR;            /* Indicate successful function execution   */
            break;                                    /*------------------------------------------*/
        case IO_STM32F20X_CAN_STOP:                   /* STOP CAN                                 */
            can->MCR |=  STM32F20X_CAN_MCR_INRQ;      /* set init bit                             */
            while ((can->MSR & STM32F20X_CAN_MSR_INAK) == 0) { /* wait for init mode              */
            }
            can->TSR = 0x00808080;                    /* abort pending transmissions              */
            result = STM32F20X_CAN_NO_ERR;            /* Indicate successful function execution   */
            break;                                    /*------------------------------------------*/
        case IO_STM32F20X_CAN_RX_STANDARD:            /* RX STANDARD                              */
            can0->FMR |=  STM32F20X_CAN_FMR_FINIT;    /* set filter initialization to init        */
            if (paraId == STM32F20X_CAN_BUS_0) {
                for (i = 0; i < 14; i++){
                    can0->FilterRegister[i].FR1 &= ~0x4; /* reset ide bit                         */
                    can0->FilterRegister[i].FR2 |=  0x4;
                }
            } else {
                for (i = 14; i < 28; i++){
                    can0->FilterRegister[i].FR1 &= ~0x4; /* reset ide bit                         */
                    can0->FilterRegister[i].FR2 |=  0x4;
                }
            }
            can0->FMR &= ~STM32F20X_CAN_FMR_FINIT;    /* set filter initialization to active      */
            result = STM32F20X_CAN_NO_ERR;            /* Indicate successful function execution   */
            break;                                    /*------------------------------------------*/
        case IO_STM32F20X_CAN_RX_EXTENDED:            /* RX EXTENDED                              */
            can0->FMR |=  STM32F20X_CAN_FMR_FINIT;    /* set filter initialization to init        */
            if (paraId == STM32F20X_CAN_BUS_0) {
                for (i = 0; i < 14; i++){
                    can0->FilterRegister[i].FR1 |= 0x4; /* set ide bit                            */
                    can0->FilterRegister[i].FR2 |= 0x4;
                }
            } else {
                for (i = 14; i < 28; i++){
                    can0->FilterRegister[i].FR1 |= 0x4; /* set ide bit                            */
                    can0->FilterRegister[i].FR2 |= 0x4;
                }
            }
            can0->FMR &= ~STM32F20X_CAN_FMR_FINIT;    /* set filter initialization to active      */
            result = STM32F20X_CAN_NO_ERR;            /* Indicate successful function execution   */
            break;                                    /*------------------------------------------*/
        case IO_STM32F20X_CAN_GET_NODE_STATUS:        /* GET NODE STATUS                          */
            status_reg = can->ESR;                    /* get error status register                */
            if ((status_reg & 0x03) != 0) {           /* Bit 1/2 Error Warning/Passive Bit        */
                *((CPU_INT08U *)argp) = 1;
            }
            if ((status_reg & 0x04) != 0) {           /* Bit 3 Bus Off Bit                        */
                *((CPU_INT08U *)argp) = 2;
            }
            if ((status_reg & 0x07) == 0) {           /* Bit 1-3 not set - bus active             */
                *((CPU_INT08U *)argp) = 0;
            }
            result = STM32F20X_CAN_NO_ERR;            /* Indicate successful function execution   */
            break;                                    /*------------------------------------------*/
        case IO_STM32F20X_CAN_SET_RX_FILTER_1:        /* SET RX FILTER 1                          */
            mask  = ((CPU_INT32U*)argp)[0];
            canId = ((CPU_INT32U*)argp)[1];
            can0->FMR |=  STM32F20X_CAN_FMR_FINIT;    /* set filter initialization to init        */
            if (canId > 0x7FF) {                      /* depending on the CAN ID                  */
                                                      /* use bit 0..28                            */
                                                      /* set ext canId + ide bit and mask         */
                if (paraId == STM32F20X_CAN_BUS_0) {
                    can0->FilterRegister[0].FR1  = (canId << 3) + 4;
                    can0->FilterRegister[0].FR2  = (mask  << 3) + 4;
                } else {
                    can0->FilterRegister[14].FR1 = (canId << 3) + 4;
                    can0->FilterRegister[14].FR2 = (mask  << 3) + 4;
                }
            } else {
                                                      /* use bit 0..10                            */
                                                      /* set std canId and mask                   */
                if (paraId == STM32F20X_CAN_BUS_0) {
                    can0->FilterRegister[0].FR1  = (canId << 21);
                    can0->FilterRegister[0].FR2  = (mask  << 21);
                } else {
                    can0->FilterRegister[14].FR1 = (canId << 21);
                    can0->FilterRegister[14].FR2 = (mask  << 21);
                }
            }
            can0->FMR &= ~STM32F20X_CAN_FMR_FINIT;    /* set filter initialization to active      */
            result = STM32F20X_CAN_NO_ERR;            /* Indicate successful function execution   */
            break;                                    /*------------------------------------------*/
        case IO_STM32F20X_CAN_SET_RX_FILTER_2:        /* SET RX FILTER 2                          */
            mask  = ((CPU_INT32U*)argp)[0];
            canId = ((CPU_INT32U*)argp)[1];
            can0->FMR |=  STM32F20X_CAN_FMR_FINIT;    /* set filter initialization to init        */
            if (canId > 0x7FF) {                      /* depending on the CAN ID                  */
                                                      /* use bit 0..28                            */
                                                      /* set ext canId + ide bit and mask         */
                if (paraId == STM32F20X_CAN_BUS_0) {
                    can0->FilterRegister[1].FR1  = (canId << 3) + 4;
                    can0->FilterRegister[1].FR2  = (mask  << 3) + 4;
                } else {
                    can0->FilterRegister[15].FR1 = (canId << 3) + 4;
                    can0->FilterRegister[15].FR2 = (mask  << 3) + 4;
                }
            } else {
                                                      /* use bit 0..10                            */
                                                      /* set std canId + ide bit and mask         */
                if (paraId == STM32F20X_CAN_BUS_0) {
                    can0->FilterRegister[1].FR1  = (canId << 21);
                    can0->FilterRegister[1].FR2  = (mask  << 21);
                } else {
                    can0->FilterRegister[15].FR1 = (canId << 21);
                    can0->FilterRegister[15].FR2 = (mask  << 21);
                }
            }
            can0->FMR &= ~STM32F20X_CAN_FMR_FINIT;    /* set filter initialization to active      */
            result = STM32F20X_CAN_NO_ERR;            /* Indicate successful function execution   */
            break;                                    /*------------------------------------------*/
        default:
            break;
    }
    CPU_CRITICAL_EXIT();

    if (result == -1) {
        DrvError = STM32F20X_CAN_FUNC_ERR;
    }
                                                       /*------------------------------------------*/
    return (result);                                   /* Return function result                   */
}

/*------------------------------------------------------------------------------------------------*/
/*!
* \brief    CAN READ DATA
*
* \ingroup  STM32F20X_CAN
*
*           Read a received can frame from a message buffer. The buffer must have space for only
*           one can frame.
*
* \param    paraId  parameter identifier, returned by XXXCANOpen()
* \param    buffer  pointer to CAN frame
* \param    size    length of CAN frame memory
*
* \return   error code (CAN frame DLC if OK, -1 if an error occurred)
*/
/*------------------------------------------------------------------------------------------------*/
CPU_INT16S STM32F20XCANRead (CPU_INT16S paraId, CPU_INT08U *buffer, CPU_INT16U size)
{
    STM32F20X_CAN_DATA *dev;                          /* Local: Pointer to can device             */
    STM32F20X_CAN_t    *can;                          /* Local: Pointer to can register           */
    CPU_INT16S          result = -1;                  /* Local: return value                      */
    STM32F20X_CANFRM   *frm;                          /* Local: Pointer to can frame              */
    CPU_INT32U          Word;                         /* Local: A word for extended IO access     */
    CPU_INT32S          FIFONumber;                   /* Local: receive fifo                      */
    CPU_SR_ALLOC();                                   /* Allocate storage for CPU status reg.     */
                                                      /*------------------------------------------*/
#if STM32F20X_CAN_ARG_CHK_CFG > 0
    if ((paraId >= STM32F20X_CAN_N_DEV) || (paraId < 0)) { /* check that paraId is in range       */
        DrvError = STM32F20X_CAN_BUS_ERR;
        return (result);
    }
    if (size != sizeof(STM32F20X_CANFRM)) {           /* check that size is plausible             */
        DrvError = STM32F20X_CAN_NO_DATA_ERR;
        return (result);
    }
    if (buffer == (void *)0) {                        /* invalid buffer pointer                   */
        DrvError = STM32F20X_CAN_ARG_ERR;
        return (result);
    }
#endif
    dev = &DevData[paraId];                           /* set pointer to can device                */
#if STM32F20X_CAN_ARG_CHK_CFG > 0
    if (dev->Use != 1) {                              /* check, that can device is opened         */
        DrvError = STM32F20X_CAN_OPEN_ERR;
        return (result);
    }
#endif
    can = (STM32F20X_CAN_t *)dev->Base;

    frm = (STM32F20X_CANFRM *)buffer;                 /* Set pointer to can frame                 */
    FIFONumber = -1;

    CPU_CRITICAL_ENTER();
    if ((can->RF0R & 0x03) >= 1) {
        FIFONumber = 0;
    } else if ((can->RF1R & 0x03) >= 1) {             /* data is available                        */
        FIFONumber = 1;
    }
    if (FIFONumber >= 0) {
                                                      /* Get the Id                               */
        Word = can->FIFOMailBox[FIFONumber].RIR & 0x04; /* get IDE bit                            */
        if (Word == 0) {                              /* is std id                                */
            frm->Identifier  = can->FIFOMailBox[FIFONumber].RIR >> 21;
        } else {
            frm->Identifier  = can->FIFOMailBox[FIFONumber].RIR >> 3;
            frm->Identifier |= STM32F20X_FF_FRAME_BIT;/* mark ext. ID                             */
        }
        if ((can->FIFOMailBox[FIFONumber].RIR & 0x02) != 0) { /* check remote frame               */
            frm->Identifier |= STM32F20X_RTR_FRAME_BIT;/* mark remote frame                       */
        }
                                                      /* Get the DLC                              */
        frm->DLC = can->FIFOMailBox[FIFONumber].RDTR & 0x0F;
                                                      /* Get the data field                       */
        frm->Data[0] = (CPU_INT08U)(can->FIFOMailBox[FIFONumber].RDLR      );
        frm->Data[1] = (CPU_INT08U)(can->FIFOMailBox[FIFONumber].RDLR >>  8);
        frm->Data[2] = (CPU_INT08U)(can->FIFOMailBox[FIFONumber].RDLR >> 16);
        frm->Data[3] = (CPU_INT08U)(can->FIFOMailBox[FIFONumber].RDLR >> 24);

        frm->Data[4] = (CPU_INT08U)(can->FIFOMailBox[FIFONumber].RDHR      );
        frm->Data[5] = (CPU_INT08U)(can->FIFOMailBox[FIFONumber].RDHR >>  8);
        frm->Data[6] = (CPU_INT08U)(can->FIFOMailBox[FIFONumber].RDHR >> 16);
        frm->Data[7] = (CPU_INT08U)(can->FIFOMailBox[FIFONumber].RDHR >> 24);

        result   = size;
    } else {
        DrvError = STM32F20X_CAN_NO_DATA_ERR;
    }
    CPU_CRITICAL_EXIT();
                                                      /*------------------------------------------*/
    return (result);                                  /* Return function result                   */
}

/*------------------------------------------------------------------------------------------------*/
/*!
* \brief    CAN WRITE DATA
*
* \ingroup  STM32F20X_CAN
*
*           Write a can frame to a message buffer. The buffer must contain only one can frame,
*           which will be written to a predefined message buffer.
*
* \param    paraId  parameter identifier, returned by XXXCANOpen()
* \param    buffer  pointer to CAN frame
* \param    size    length of CAN frame memory
*
* \return   error code (CAN frame DLC if OK, -1 if an error occurred)
*/
/*------------------------------------------------------------------------------------------------*/
CPU_INT16S STM32F20XCANWrite (CPU_INT16S paraId, CPU_INT08U *buffer, CPU_INT16U size)
{
    STM32F20X_CAN_DATA *dev;                          /* Local: Pointer to can device             */
    STM32F20X_CAN_t    *can;                          /* Local: Pointer to can register           */
    CPU_INT16S          result          = -1;         /* Local: return value                      */
    STM32F20X_CANFRM   *frm;                          /* Local: Pointer to can frame              */
    CPU_INT32U          Word;                         /* Local: A word for extended IO access     */
    CPU_INT16S          TransmitMailbox = -1;         /* Local: transmit mailbox number           */
    CPU_SR_ALLOC();                                   /* Allocate storage for CPU status reg.     */
                                                      /*------------------------------------------*/
#if STM32F20X_CAN_ARG_CHK_CFG > 0
    if ((paraId >= STM32F20X_CAN_N_DEV) || (paraId < 0)) { /* check that paraId is in range       */
        DrvError = STM32F20X_CAN_BUS_ERR;
        return (result);
    }
    if (size != sizeof(STM32F20X_CANFRM)) {           /* check that size is plausible             */
        DrvError = STM32F20X_CAN_NO_DATA_ERR;
        return (result);
    }
    if (buffer == (void *)0) {                        /* invalid buffer pointer                   */
        DrvError = STM32F20X_CAN_ARG_ERR;
        return (result);
    }
#endif
    dev = &DevData[paraId];                           /* set pointer to can device                */
#if STM32F20X_CAN_ARG_CHK_CFG > 0
    if (dev->Use != 1) {                              /* check, that can device is opened         */
        DrvError = STM32F20X_CAN_OPEN_ERR;
        return (result);
    }
#endif
    can = (STM32F20X_CAN_t *)dev->Base;

    CPU_CRITICAL_ENTER();
    frm = (STM32F20X_CANFRM *)buffer;                 /* Set pointer to can frame                 */

