embedded-office/uc-can/Drivers/STM32F20X/drv_can.c
    if (frm->Identifier > 0x7FF) {
        Word = 0x80000000L;                           /* identifier extended format               */
    } else {
        Word = 0x00000000L;                           /* identifier standard format               */
    }
    Word |= (frm->DLC << 16);
                                                      /* Select one empty transmit mailbox        */
    if ((can->TSR & STM32F20X_CAN_TSR_TME0) == STM32F20X_CAN_TSR_TME0) {
        TransmitMailbox = 0;
    } else if ((can->TSR & STM32F20X_CAN_TSR_TME1) == STM32F20X_CAN_TSR_TME1) {
        TransmitMailbox = 1;
    } else if ((can->TSR & STM32F20X_CAN_TSR_TME2) == STM32F20X_CAN_TSR_TME2) {
        TransmitMailbox = 2;
    }

    if (TransmitMailbox >= 0) {
                                                      /* Set up the Id                            */
        can->TxMailBox[TransmitMailbox].TIR &= STM32F20X_CAN_TIxR_TXRQ;
        if (frm->Identifier <= 0x7FF) {
            Word = frm->Identifier << 21;

            can->TxMailBox[TransmitMailbox].TIR |= Word;
        } else {
            Word = frm->Identifier & 0x1FFFFFFF;
            Word = Word << 3;

            can->TxMailBox[TransmitMailbox].TIR |= (Word | 0x04 );
        }
                                                      /* Set up the DLC                           */
        can->TxMailBox[TransmitMailbox].TDTR &= 0xFFFFFFF0;
        can->TxMailBox[TransmitMailbox].TDTR |= (CPU_INT32U)frm->DLC;
                                                      /* Set up the data field                    */
        can->TxMailBox[TransmitMailbox].TDLR = (((CPU_INT32U)frm->Data[3] << 24) |
                                                ((CPU_INT32U)frm->Data[2] << 16) |
                                                ((CPU_INT32U)frm->Data[1] <<  8) |
                                                ((CPU_INT32U)frm->Data[0]));
        can->TxMailBox[TransmitMailbox].TDHR = (((CPU_INT32U)frm->Data[7] << 24) |
                                                ((CPU_INT32U)frm->Data[6] << 16) |
                                                ((CPU_INT32U)frm->Data[5] <<  8) |
                                                ((CPU_INT32U)frm->Data[4]));
                                                      /* Request transmission                     */
        can->TxMailBox[TransmitMailbox].TIR |= STM32F20X_CAN_TIxR_TXRQ;

        result   = size;
    } else {
        DrvError = STM32F20X_CAN_BUSY_ERR;
    }
    CPU_CRITICAL_EXIT();
                                                      /*------------------------------------------*/
    return (result);                                  /* Return function result                   */
}
